const { reply } = require('@lib/utils');
const config    = require('@config');

async function handle(sock, messageInfo) {
    const { m } = messageInfo;

    // 🧾 نص المعلومات عن السكربت / Script information text
    const text = `╭「 𝒔𝒄𝒓𝒊𝒑𝒕 𝑬𝒂𝒔𝒚𝒔𝒕𝒆𝒑𝑩𝑶𝑻 」
│
│◧ ᴠᴇʀꜱɪᴏɴ : ${config.version}
│◧ ᴛʏᴘᴇ ᴘʟᴜɢɪɴꜱ / نوع الإضافات : Plugins Type
│◧ ɴᴏ ᴇɴᴄ 100% / بدون تشفير
│◧ ɴᴏ ʙᴜɢ & ɴᴏ ᴇʀʀᴏʀ / بدون أخطاء
│◧ ʜᴀʀɢᴀ ? free / مجاني بالكامل 💥
│◧ ꜰʀᴇᴇ ᴀᴘɪᴋᴇʏ / مفتاح API مجاني
│◧ ꜰʀᴇᴇ ᴜᴘᴅᴀᴛᴇ / تحديثات مجانية
│◧ ʙɪꜱᴀ ʀᴜɴ ᴅɪ ᴘᴀɴᴇʟ / يمكن تشغيله على لوحة (Panel)
╰────────────────────────◧

╭「 Link Download 」
│
◧ ᴡᴇʙꜱɪᴛᴇ : https://easystep.life/download
╰────────────────────────◧`;

    // 📤 إرسال الرد / Send reply
    await reply(m, text);
}

// ⚙️ إعدادات الأمر / Command settings
module.exports = {
    handle,
    Commands    : ['sc', 'script'],  // أوامر التشغيل / command names
    OnlyPremium : false,             // متاح للجميع
    OnlyOwner   : false              // ليس للمالك فقط
};